In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from ydata_profiling import ProfileReport

In [7]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
report = ProfileReport(df, title="Titanic Dataset Profiling Report")
report.to_file("titanic_report.html")

Summarize dataset:  35%|███████████▏                    | 7/20 [00:00<00:01, 11.97it/s, Describe variable: embark_town]
Summarize dataset:  50%|██████████████████▌                  | 10/20 [00:00<00:00, 12.19it/s, Describe variable: alone]
100%|██████████████████████████████████████████████████████████████████████████████████| 15/15 [00:00<00:00, 73.05it/s]
Summarize dataset: 100%|████████████████████████████████████████████████████| 41/41 [00:10<00:00,  3.88it/s, Completed]
Generate report structure: 100%|█████████████████████████████████████████████████████████| 1/1 [00:08<00:00,  8.88s/it]
Render HTML: 100%|███████████████████████████████████████████████████████████████████████| 1/1 [00:02<00:00,  2.82s/it]
Export report to file: 100%|█████████████████████████████████████████████████████████████| 1/1 [00:00<00:00, 39.76it/s]

In [10]:
from IPython.display import FileLink
FileLink("titanic_report.html")

C:\Users\User\Jupyter.ML\ML_Supervised\titanic_report.html